In [ ]:
import requests
import pandas as pd

# 1. API endpoint
url = "https://api.census.gov/data/2023/pep/charv"

# 2. Parameters
params = {
    "get": "NAME,STATE,YEAR,POP,AGE,SEX",
    "for": "state:*"
}

# 3. Send request
response = requests.get(url, params=params)

# 4. Parse JSON
data = response.json()

# 5. Convert to DataFrame
df = pd.DataFrame(data[1:], columns=data[0])

df.sample(5)

      NAME STATE  YEAR      POP   AGE SEX state
0  Alabama    01  2020  5024294  0000   0    01
1  Alabama    01  2020  5031864  0000   0    01
2  Alabama    01  2021  5050380  0000   0    01
3  Alabama    01  2022  5073903  0000   0    01
4  Alabama    01  2023  5108468  0000   0    01

In [24]:
df.to_csv(
    "original_dataset.csv",
    index=False
)

In [18]:
df.sample(5)

                NAME STATE  YEAR     POP   AGE SEX state
2514          Alaska    02  2023    5959  2400   1    02
86254  West Virginia    54  2020   11075  2500   1    54
28567           Iowa    19  2021   42799  5900   0    19
62705           Ohio    39  2020  143056  0800   0    39
58905       New York    36  2023  137261  6000   2    36

In [23]:
print(df.shape)
print(type(df.AGE[0]))

(90480, 7)
<class 'str'>